package Course2.Homeworks.HomeWork1;

public class Questions {

    //1. Что делать если возникает Error?
    //2. Как происходит процесс обработки, т.е. как понять какое нужно Checked или Unchecked
    //и в какой момент это делается, сразу при написании кода нужно предугадать или по истечении
    //какого то времени?
    //3. Если программа сама выбрасывает исключение, то она перестает дальше работать?
    //Для этого и нужно его обработать вручную?
    //4. В примере применения нескольких операторов catch после срабатывания "Деление на ноль",
    //след исключение "Ошибка индексации массива" пропустит программа? На практике важно, каждую отдельную
    //ситуацию обрабатывать?
    //5. Про оператор throw не понял. Можно на уроке с примером как это использовать?
    //6. Какой производный класс исключений лучше использовать при создании собственного класса исключений?
    //Сдесь тоже хочется пример))
    //7. При использовании опрератора или оба исключения выведутся последовательно?
 }
